
import React from 'react';
import { ReactMic } from 'react-mic';
import FileSaver from 'file-saver';

import './Form.css';

export default class Form extends React.Component {
  constructor(props) {
    super(props);
    this.scripts = `ฉันจะออกไปทานอาหารกลางวัน
เขาจะกลับมาตอนบ่ายโมงครึ่ง
ฉันจะว่างหลังอาหารกลางวัน
เธอลาออกไปแล้ว
เขาได้รับการเลื่อนตำแหน่ง
เธอลาคลอด
วันนี้เขาลาป่วย
วันนี้เขาไม่อยู่
เธออยู่ในช่วงวันหยุด
วันนี้ฉันไม่สบาย และไม่สามารถไปทำงานได้ในวันนี้
ขณะนี้เขาอยู่กับลูกค้า
ฉันจะมาพบคุณอีกสักครู่
ขอโทษที่ให้คุณรอ
ฉันช่วยอะไรคุณได้บ้าง
คุณต้องการความช่วยเหลืออะไรไหม
ฉันจะทำอะไรให้คุณได้บ้าง
คอมพิวเตอร์ของฉันมีปัญหา
ระบบคอมพิวเตอร์ใช้ไม่ได้อยู่ขณะนี้
ระบบอินเทอร์เน็ตเสียอยู่ขณะนี้
ฉันไม่สามารถเข้าอีเมล์ได้
พรินเตอร์ไม่ทำงาน
นักวิชาการด้านศาสนวิทยา ออกมาให้ข้อมูลหลัง กรมศิลปากรได้แก้ไขข้อมูลเรื่อง “นางนพมาศ” อย่างเป็นทางการแล้ว ว่า นางนพมาศไม่มีตัวตนจริง วอนเลิกพูดเลิกสอนว่า ประเพณีลอยกระทงเกิดโดยนางนพมาศ
กสทช. ผ่านหลักเกณฑ์การเรียกคืนคลื่นความถี่ที่ไม่ได้ใช้ประโยชน์ หรือใช้ประโยชน์ไม่คุ้มค่า พร้อมเยียวยา เพื่อนำกลับมาประมูลใหม่ และส่งไปประกาศในราชกิจจานุเบกษาเพื่อให้มีผลบังคับใช้ พร้อมมีมติอนุญาตให้ AIS และ TRUE สาธิตเทคโนโลยี 5G ในวันที่ 22 พ.ย.-15 ธ.ค. นี้
เมื่อวันที่ 22 พ.ย. ที่สน.โคกคราม กวาง กมลชนก เขมะโยธิน อายุ 51 ปี ดารานักแสดงชื่อดัง เดินทางเข้าพบ ร.ต.อ.ฟ้าคำรณ หรี่หร่อง ร้อยเวรสอบสวน สน.โคกคราม เพื่อลงบันทึกประจำวัน ไว้เป็นหลักฐาน กรณีถูกละเมิดลิขสิทธิ์เกี่ยวกับโฆษณา เพื่อประโยชน์ทางการค้า โดยไม่รับอนุญาตในสื่ออิเลคทรอนิกส์ออนไลน์
“ปานเทพ” นำคณะเครือข่ายกัญชาเพื่อการแพทย์ ยื่นหนังสือ ปธ.สนช.แก้ร่าง พ.ร.บ.ยาเสพติด พร้อมแนะ 4 ข้อ ไม่ให้ผูกขาดใช้ประโยชน์ ยกเลิกจดสิทธิบัตร ปลดล็อกการใช้กัญชาให้แพทย์แผนไทย
วันนี้ (21 พ.ย.) สำนักข่าวท้องถิ่นในประเทศมาเลเซีย ได้รายงานการเสียชีวิตของอดีตแกนนำสมาชิกขบวนการปลดปล่อยปัตตานี ในนามพูโล (PULO) เมื่อวันที่ 20 พ.ย.ที่ผ่านมา จากโรคปวดท้องอย่างแรงจนเสียชีวิตในวันเดียวกัน ทราบชื่อคือ นายซาการียา อาแว หรือในนามฉายาว่า “เปาะยาบูเก็ตซูดอ” จากภาพถ่ายผู้ตายจะอยู่ด้านขวามือ ซึ่งเป็นภาพถ่ายในช่วงที่เป็นกองกำลังติดอาวุธของขบวนการปลดปล่อยปัตตานีพูโล
ด้าน ครูปรีชา กล่าวว่า รู้สึกสบายใจตั้งแต่คดีเริ่มแรกแล้วที่ได้นำความจริงมาขึ้นสู่ศาล และต้องขอขอบคุณสื่อมวลชนที่คอยติดตามข่าวนี้และขอให้คอยติดตามกันต่อไป
ผู้สื่อข่าวรายงานว่า ได้มีฝูงลิงเขาน้อยราว 40 ตัว ที่ยกฝูงลงมาหากินบริเวณสระบัวแหลมสมิหลา เขตเทศบาลนครสงขลา และบ้านพักข้าราการในบริเวณนั้น และได้วิ่งข้ามถนนไปมา ปรากฏว่ามีลูกลิงถูกรถชนตาย 1 ตัว ขณะที่กำลังวิ่งข้ามถนน
"บิ๊กเป้" รณฤทธิ์ ซื่อวาจา ผู้อำนวยการสโมสร "กิเลนผยอง" เอสซีจี เมืองทอง ยูไนเต็ด ออกมาเผยว่า ในฤดูกาลหน้า ธีรศิลป์ แดงดาด และธีราทร บุญมาทัน 2 แข้งตัวเก่ง จะคัมแบ็คกลับสู่ถิ่นกิเลนผยองอีกครั้ง หลังไปค้าแข้งที่ญี่ปุ่นด้วยสัญญายืมตัว 1 ปี
แม้ทีมชาติกัมพูชาเก็บ 3 คะแนแรกใน ซูซูกิ คัพ ได้สำเร็จหลังเปิดบ้านเอาชนะลาว 3-1 แต่ยังกระเด็นตกรอบพร้อมลาว หลังเหลือการแข่งขันเพียงนัดเดียว ส่วนผลอีกหนึ่งคู่ เมียนมาร์ เสมอ เวียดนาม 0-0 ในฟุตบอลเอเอฟเอฟ ซูซูกิ คัพ 2018 รอบแบ่งกลุ่ม กลุ่มเอ เมื่อวันที่ 20 พ.ย. 61
ทีมไทย อันประกอบไปด้วย "โปรอาร์ม" กิรเดช อภิบาลรัตน์ และ "โลมายักษ์" พรหม มีสวัสดิ์ เปิดตัวในศึกไอเอสพีเอส ฮันด้า เมลเบิร์น เวิลด์ คัฟ ออฟ กอล์ฟ เมื่อวันพฤหัสบดีที่ 22 พฤศจิกายน ที่ผ่านมา ด้วยการทำไป 5 อันเดอร์พาร์ จนทำให้คู่ของพวกเขาอยู่อันดับ 20 ร่วม
พ่อเจ้าพระขัตติยะรามังกูร เข้ามาในห้องบรรทมด้วยสีหน้าครุ่นคิด หวนนึกถึงการสนทนากับแม่เจ้าปทุมรัตน์ก่อนหน้านี้
ตอนนั้นพ่อเจ้าตกใจมาก มองหน้าแม่เจ้า หลังอีกฝ่ายเล่าเรื่องสู่ขอสะอาดให้จบลง
ยอมรับความจริงเสียเถิดค่ะท่าน โรคของอิฉันรักษาไม่หายหรอก ยังไงวันหนึ่ง อิฉันก็ต้องจากท่านไป แต่อิฉันจะไม่ยอมเป็นเมียใจดำ ทิ้งให้ท่านต้องอยู่โดดเดี่ยวเพียงลำพัง จะหวังพึ่งพาลูกเรา เขาก็ต้องมีชีวิตของตัวเอง สิ่งเดียวที่อิฉันต้องทำคือต้องหาผู้หญิงดีๆ สักคนมาดูแลท่าน
โธ่เอ๋ย แม่บัว ฉันอาจจะไปก่อนแม่บัวก็ได้ ใครจะรู้ เรื่องนั้นมันยังอีกไกล ยาของพ่อแพทย์พุทไธก็ได้ผลดี ดูสิ แค่ไม่กี่วัน แม่บัวก็ดูมีน้ำมีนวลขึ้นมาก
ในจดหมายมีใจความว่า “กลับมาทำตามสัญญาที่เคยให้กัน”
ต้า, โจ, บี, เสือ และ กอล์ฟ สงสัยว่ามันคืออะไร พวกเขาจึงตัดสินใจเดินทางกลับไปที่บ้านเกิดของ “X” เพื่อหาคำตอบ
ดาญ่าไปทำงานตีซี้เนตรสุดาจนขโมยพาสเวิดเข้าคอมเพื่อเอาไปศึกษาหาความผิดปกติของบัญชีต่อที่บ้าน
นอกจากรักคุณแล้วผมก็ไม่เก่งอะไรเลย
ฉันตายโดยปราศจากคนที่รักฉัน แต่ฉันก็อิ่มใจว่า ฉันมีคนที่ฉันรัก
สิ่งสำคัญของการเดินทางไม่ใช่จุดหมาย แต่อยู่ที่ระหว่างทางต่างหาก`.split("\n");

this.results = `ฉันจะ ออกไป ทาน อาหารกลางวัน
เขาจะ กลับมา ตอน บ่าย โมง ครึ่ง
ฉันจะ ว่าง หลัง อาหารกลางวัน
เอ้า เธอ ลาออก ไปแล้ว
อ เขา ได้รับ การ เลื่อน ตำแหน่ง
เธอรัก คลอด
วันนี้ เขา ลาป่วย
วัน นี้ เค้า ไม่ อยู่
เธอ อยู่ ในช่วง วันหยุด
วันนี้ ฉัน ไม่ สบาย และไม่ สามารถ ไปทำงาน ได้ ในวัน นี้
ขณะนี้ เขา อยู่ กับ ลูกค้า
ฉัน จะ มาพบ คุณ อีก สักครู่
ขอโทษ ที่ ให้คุณ เหรอ
ฉัน ช่วยอะไร คุณได้ บ้าง
คุณ ต้องการความ ช่วยเหลือ อะไร ไม่
ฉันจะ ทำอะไร ให้คุณ ได้ บ้าง
คอมพิวเตอร์ ของฉัน มีปัญหา
ระบบคอมพิวเตอร์ ใช้ ไม่ได้ อยู่ ขนาดนี้
ระบบ อินเทอร์เน็ต เสีย อยู่ ขณะนี้
ฉันไม่ สามารถ เข้า อีเมล ได้
เพียงแต่ ไม่ทำงาน
นักวิชาการ ด้าน ศาสตร์ วิทยา ออก มาให้ ข้อมูล หลัง กังวล กรง ศิลปะ ร์ สะ แก้ไข ข้อมูล เรื่อง งบประมาณ อย่างเป็น ทางการ
ก็ ชาว ท่า ฉ ผ่าน หลักเกณฑ์ การ เรียกคืน คลื่น คลื่น ความถี่ ที่ไม่ ได้ใช้ ประโยชน์ และใช้ ประโยชน์ ไม่ คุ้มค่า พร้อม เยียวยา เพื่อนำ กลับมา ประมูล ใหม่ และ ส่ง ไป ประกาศ ใน ราชกิจ จานุ
เมื่อวัน ที่ จะ สอง พฤศจิกายน ที่สาม สน โคกคราม กว้าง กมล ชนก เข มะ โยธิน อายุ ห้าสิบ เอ็ด ปี ดารา นักแสดง ชื่อดัง เดินทางเข้า
ปาน เทพ นำ คณะ เครือข่าย กัญชา เพื่อ การ เเพทย์ ยื่น หนังสือ ปธ สนช แก้ ร่าง พ ร บ ยาเสพติด พร้อม แนะ สี่ ขอไม่ ให้ ผูกขาด ใช้ประโยชน์ ยกเลิก จด จิตติ บัตร
ที่ ยี่สิบ เอ็ด ก ซิ ก้า ยนต์ สำนักข่าว ท้องถิ่น ในประเทศ มาเลเซีย ได้ รายงาน การ เสียชีวิต ของ อดีต แกนนำ สมาชิก ขบวนการ ปลดปล่อย ปัตตานี ใน นาม พูโล เมื่อ วัน ที่
การกู้ ปรีชา กล่าวว่า รู้สึก สบายใจ ตั้งแต่ คดี เริ่มแรก แล้วที่ ได้นำ ความจริง มาสู่ ขึ้นสู่ ศาล และ ต้อง ขอขอบคุณ สื่อมวลชน ที่ ช่วย ติดตาม ข่าว นี้ และขอ ให้ ครับ
ผู้สื่อข่าว รายงานว่า ได้มี ฝูง บิน เข้า หน่อย ราว สี่ ตัว ที่ ยก ฝูง ลงมา หากิน บริเวณ ษ ษ บัว แหลม สมิหลา เขต เทศ บาล น คร
นิกเก รณฤทธิ์ ซื่อ หวาน จ้า ผู้อำนวยการ สโมสร เคนห์ ผยอง เอสซีจี เมืองทอง ยูไนเต็ด ออกมา เผยว่า ใน ฤดูกาล หน้า ทีม
เห็น ชาติ กัมพูชา เก็บ สาม คะแนน แรก ใน ซูซูกิ คัพ ได้ สำเร็จ หลัง เปิดบ้าน เอาชนะ ราว สาม ต่อ หนึ่ง และยัง แต่ กระเด็น ตกรอบ พร้อม ล่าว หลัง เหลือ การแข่งขัน เพียง นัด เดียว
คิม ไค อัน นักกอล์ฟ ไปด้วย โป๋ อ่าว กิ เดช อภิบาล รัตน์ และ โลมา ยักษ์ ผมมี สวัสดิ์ เปิดตัว ใน ศึก ไอเอส มี เอส อัน
พ่อ เจ้า พระ ขันติ ยะลา มัง กุ เข้ามา ในห้อง มัน ทม ด้วย สีหน้า คุณ คิด หวน นึกถึง การ สนทนา กับ แม่ เจ้า ปทุม รัตน์ ห้า ก่อนหน้านี้
ตอนนั้น พ่อ เจ้า ตกใจ มาก มองหน้า แม่เจ้า หลัง อีก ฝ่าย เล่า เรื่อง สู่ ขอ สะอาด ให้ จบลง
สำหรับ ความจริง เสีย เถิด ค่ะ ท่าน โลก ของ อิชั้น รักษา ไม่หาย หรอก ยังไง วันหนึ่ง อิฉัน ก็ ต้อง จาก กัน ไป แต่ อิฉัน จะไม่ ยอม เป็น เมีย ใจ ดัง ทิ้ง ให้ ท่าน ต้อง อยู่ โดดเดี่ยวกลาง
โอ๊ย แน่ บัว ฉัน อาจ จะไป ก่อนหน้า บัว ก็ได้ ใคร จะรู้ เรื่อง นั้น มัน ยัง อีกไกล อย่า ของ พ่อ แพทย์ สุดท้าย ก็ ได้ผล ดี อยู่ ดูสิ แค่ ไม่กี่ วัน แม่ บัว ก็
นาย จะตาย มีใจ ความว่า ดาบ มา ทำตาม สัญญา ที่เคย ให้ กัน
ล่าโจร มี เสื้อ และ กอล์ฟ สงสัย มาก นั่น คือ อะไร พวกเขา จึง ตัดสินใจ เดินทาง กลับ ไปที่ บ้าน เกิด ของ เอ็กซ์ เพื่อหา คำตอบ
ทายาท ไปทำงาน ตี สี่ เน สุดา โจร ขโมย พาสเวิร์ด ของ คอม เพื่อ เอาไป ศึกษา หา ความ ผิดปกติ ของ แมนเชสเตอร์ ที่บ้าน
นอกจาก รัก คุณ แล้ว ผม ก็ ไม่ เก่ง อะไร เลย
ฉัน ตาย โดย ปราศจาก คนที่ รักฉัน แต่ ฉันก็ อิ่มใจ ว่า ฉันมี คนที่ ฉันรัก
สิ่งสำคัญ ของการ เดินทาง ไม่ใช่ จุดหมาย แต่ อยู่ที่ ระหว่าง ทาง ต่างหาก`.split("\n");

    this.state = {
      speaker: 'BallSirisak',
      record: false,
      filename: 'hello.webm',
      reading_idx: 0,
      reading_script: this.scripts[0],
      cancel_save: false
    };

    this.onStop = this.onStop.bind(this)
    this.handleChangeSpeaker = this.handleChangeSpeaker.bind(this);

  }

  handleChangeSpeaker(event) {
    this.setState({speaker: event.target.value});
  }

  startRecording = () => {
    this.setState({
      record: true
    });
  }

  stopRecording = () => {
    this.setState({
      record: false
    });
  }

  stopRecordingNoSave = () => {
    this.setState({
      record: false,
      cancel_save: true
    });
  }

  onData(recordedBlob) {
    console.log('chunk of real-time data is: ', recordedBlob);
  }

  onStop(recordedBlob) {
    console.log('recordedBlob is: ', recordedBlob);

    if (this.state.cancel_save){
      this.setState({
        cancel_save: false
      });
    }else{
      FileSaver.saveAs(recordedBlob.blob, this.state.speaker + '_'+(this.state.reading_idx+1)+'.webm');


      let new_idx = this.state.reading_idx + 1

      if ( new_idx === this.scripts.length){
        alert('Finished recording');
        this.setState({
          reading_idx: new_idx,
          reading_script: "All script finished"
        });
      } else {
        this.setState({
          reading_idx: new_idx,
          reading_script: this.scripts[new_idx]
        });
      }
    }



  }

  render() {
    return (
      <div>
          {this.scripts.map((line,idx)=>{
            return <div className='script-result'>
            <div className='script'>
            <div className='number'>
              {idx+1}
            </div>
            {line}
            </div>
              <div className='result'>
                {this.results[idx]}
              </div>
            </div>

          })}
      </div>
    );
  }
}
