
import React from 'react';
import { ReactMic } from 'react-mic';
import FileSaver from 'file-saver';

import './Form.css';

export default class Form extends React.Component {
  constructor(props) {
    super(props);
    this.scripts = `ฉันจะออกไปทานอาหารกลางวัน
เขาจะกลับมาตอนบ่ายโมงครึ่ง
ฉันจะว่างหลังอาหารกลางวัน
เธอลาออกไปแล้ว
เขาได้รับการเลื่อนตำแหน่ง
เธอลาคลอด
วันนี้เขาลาป่วย
วันนี้เขาไม่อยู่
เธออยู่ในช่วงวันหยุด
วันนี้ฉันไม่สบาย และไม่สามารถไปทำงานได้ในวันนี้
ขณะนี้เขาอยู่กับลูกค้า
ฉันจะมาพบคุณอีกสักครู่
ขอโทษที่ให้คุณรอ
ฉันช่วยอะไรคุณได้บ้าง
คุณต้องการความช่วยเหลืออะไรไหม
ฉันจะทำอะไรให้คุณได้บ้าง
คอมพิวเตอร์ของฉันมีปัญหา
ระบบคอมพิวเตอร์ใช้ไม่ได้อยู่ขณะนี้
ระบบอินเทอร์เน็ตเสียอยู่ขณะนี้
ฉันไม่สามารถเข้าอีเมล์ได้
พรินเตอร์ไม่ทำงาน
นักวิชาการด้านศาสนวิทยา ออกมาให้ข้อมูลหลัง กรมศิลปากรได้แก้ไขข้อมูลเรื่อง “นางนพมาศ” อย่างเป็นทางการแล้ว ว่า นางนพมาศไม่มีตัวตนจริง วอนเลิกพูดเลิกสอนว่า ประเพณีลอยกระทงเกิดโดยนางนพมาศ
กสทช. ผ่านหลักเกณฑ์การเรียกคืนคลื่นความถี่ที่ไม่ได้ใช้ประโยชน์ หรือใช้ประโยชน์ไม่คุ้มค่า พร้อมเยียวยา เพื่อนำกลับมาประมูลใหม่ และส่งไปประกาศในราชกิจจานุเบกษาเพื่อให้มีผลบังคับใช้ พร้อมมีมติอนุญาตให้ AIS และ TRUE สาธิตเทคโนโลยี 5G ในวันที่ 22 พ.ย.-15 ธ.ค. นี้
เมื่อวันที่ 22 พ.ย. ที่สน.โคกคราม กวาง กมลชนก เขมะโยธิน อายุ 51 ปี ดารานักแสดงชื่อดัง เดินทางเข้าพบ ร.ต.อ.ฟ้าคำรณ หรี่หร่อง ร้อยเวรสอบสวน สน.โคกคราม เพื่อลงบันทึกประจำวัน ไว้เป็นหลักฐาน กรณีถูกละเมิดลิขสิทธิ์เกี่ยวกับโฆษณา เพื่อประโยชน์ทางการค้า โดยไม่รับอนุญาตในสื่ออิเลคทรอนิกส์ออนไลน์
“ปานเทพ” นำคณะเครือข่ายกัญชาเพื่อการแพทย์ ยื่นหนังสือ ปธ.สนช.แก้ร่าง พ.ร.บ.ยาเสพติด พร้อมแนะ 4 ข้อ ไม่ให้ผูกขาดใช้ประโยชน์ ยกเลิกจดสิทธิบัตร ปลดล็อกการใช้กัญชาให้แพทย์แผนไทย
วันนี้ (21 พ.ย.) สำนักข่าวท้องถิ่นในประเทศมาเลเซีย ได้รายงานการเสียชีวิตของอดีตแกนนำสมาชิกขบวนการปลดปล่อยปัตตานี ในนามพูโล (PULO) เมื่อวันที่ 20 พ.ย.ที่ผ่านมา จากโรคปวดท้องอย่างแรงจนเสียชีวิตในวันเดียวกัน ทราบชื่อคือ นายซาการียา อาแว หรือในนามฉายาว่า “เปาะยาบูเก็ตซูดอ” จากภาพถ่ายผู้ตายจะอยู่ด้านขวามือ ซึ่งเป็นภาพถ่ายในช่วงที่เป็นกองกำลังติดอาวุธของขบวนการปลดปล่อยปัตตานีพูโล
ด้าน ครูปรีชา กล่าวว่า รู้สึกสบายใจตั้งแต่คดีเริ่มแรกแล้วที่ได้นำความจริงมาขึ้นสู่ศาล และต้องขอขอบคุณสื่อมวลชนที่คอยติดตามข่าวนี้และขอให้คอยติดตามกันต่อไป
ผู้สื่อข่าวรายงานว่า ได้มีฝูงลิงเขาน้อยราว 40 ตัว ที่ยกฝูงลงมาหากินบริเวณสระบัวแหลมสมิหลา เขตเทศบาลนครสงขลา และบ้านพักข้าราการในบริเวณนั้น และได้วิ่งข้ามถนนไปมา ปรากฏว่ามีลูกลิงถูกรถชนตาย 1 ตัว ขณะที่กำลังวิ่งข้ามถนน
"บิ๊กเป้" รณฤทธิ์ ซื่อวาจา ผู้อำนวยการสโมสร "กิเลนผยอง" เอสซีจี เมืองทอง ยูไนเต็ด ออกมาเผยว่า ในฤดูกาลหน้า ธีรศิลป์ แดงดาด และธีราทร บุญมาทัน 2 แข้งตัวเก่ง จะคัมแบ็คกลับสู่ถิ่นกิเลนผยองอีกครั้ง หลังไปค้าแข้งที่ญี่ปุ่นด้วยสัญญายืมตัว 1 ปี
แม้ทีมชาติกัมพูชาเก็บ 3 คะแนแรกใน ซูซูกิ คัพ ได้สำเร็จหลังเปิดบ้านเอาชนะลาว 3-1 แต่ยังกระเด็นตกรอบพร้อมลาว หลังเหลือการแข่งขันเพียงนัดเดียว ส่วนผลอีกหนึ่งคู่ เมียนมาร์ เสมอ เวียดนาม 0-0 ในฟุตบอลเอเอฟเอฟ ซูซูกิ คัพ 2018 รอบแบ่งกลุ่ม กลุ่มเอ เมื่อวันที่ 20 พ.ย. 61
ทีมไทย อันประกอบไปด้วย "โปรอาร์ม" กิรเดช อภิบาลรัตน์ และ "โลมายักษ์" พรหม มีสวัสดิ์ เปิดตัวในศึกไอเอสพีเอส ฮันด้า เมลเบิร์น เวิลด์ คัฟ ออฟ กอล์ฟ เมื่อวันพฤหัสบดีที่ 22 พฤศจิกายน ที่ผ่านมา ด้วยการทำไป 5 อันเดอร์พาร์ จนทำให้คู่ของพวกเขาอยู่อันดับ 20 ร่วม
พ่อเจ้าพระขัตติยะรามังกูร เข้ามาในห้องบรรทมด้วยสีหน้าครุ่นคิด หวนนึกถึงการสนทนากับแม่เจ้าปทุมรัตน์ก่อนหน้านี้
ตอนนั้นพ่อเจ้าตกใจมาก มองหน้าแม่เจ้า หลังอีกฝ่ายเล่าเรื่องสู่ขอสะอาดให้จบลง
ยอมรับความจริงเสียเถิดค่ะท่าน โรคของอิฉันรักษาไม่หายหรอก ยังไงวันหนึ่ง อิฉันก็ต้องจากท่านไป แต่อิฉันจะไม่ยอมเป็นเมียใจดำ ทิ้งให้ท่านต้องอยู่โดดเดี่ยวเพียงลำพัง จะหวังพึ่งพาลูกเรา เขาก็ต้องมีชีวิตของตัวเอง สิ่งเดียวที่อิฉันต้องทำคือต้องหาผู้หญิงดีๆ สักคนมาดูแลท่าน
โธ่เอ๋ย แม่บัว ฉันอาจจะไปก่อนแม่บัวก็ได้ ใครจะรู้ เรื่องนั้นมันยังอีกไกล ยาของพ่อแพทย์พุทไธก็ได้ผลดี ดูสิ แค่ไม่กี่วัน แม่บัวก็ดูมีน้ำมีนวลขึ้นมาก
ในจดหมายมีใจความว่า “กลับมาทำตามสัญญาที่เคยให้กัน”
ต้า, โจ, บี, เสือ และ กอล์ฟ สงสัยว่ามันคืออะไร พวกเขาจึงตัดสินใจเดินทางกลับไปที่บ้านเกิดของ “X” เพื่อหาคำตอบ
ดาญ่าไปทำงานตีซี้เนตรสุดาจนขโมยพาสเวิดเข้าคอมเพื่อเอาไปศึกษาหาความผิดปกติของบัญชีต่อที่บ้าน
นอกจากรักคุณแล้วผมก็ไม่เก่งอะไรเลย
ฉันตายโดยปราศจากคนที่รักฉัน แต่ฉันก็อิ่มใจว่า ฉันมีคนที่ฉันรัก
สิ่งสำคัญของการเดินทางไม่ใช่จุดหมาย แต่อยู่ที่ระหว่างทางต่างหาก`.split("\n");

    this.state = {
      speaker: 'BallSirisak',
      record: false,
      filename: 'hello.webm',
      reading_idx: 0,
      reading_script: this.scripts[0],
      cancel_save: false
    };
    
    this.onStop = this.onStop.bind(this)
    this.handleChangeSpeaker = this.handleChangeSpeaker.bind(this);

  }
  
  handleChangeSpeaker(event) {
    this.setState({speaker: event.target.value});
  }

  startRecording = () => {
    this.setState({
      record: true
    });
  }

  stopRecording = () => {
    this.setState({
      record: false
    });
  }
  
  stopRecordingNoSave = () => {
    this.setState({
      record: false,
      cancel_save: true
    });
  }

  onData(recordedBlob) {
    console.log('chunk of real-time data is: ', recordedBlob);
  }

  onStop(recordedBlob) {
    console.log('recordedBlob is: ', recordedBlob);
    
    if (this.state.cancel_save){
      this.setState({
        cancel_save: false
      });
    }else{
      FileSaver.saveAs(recordedBlob.blob, this.state.speaker + '_'+(this.state.reading_idx+1)+'.webm');
    
    
      let new_idx = this.state.reading_idx + 1
      
      if ( new_idx === this.scripts.length){
        alert('Finished recording');
        this.setState({
          reading_idx: new_idx,
          reading_script: "All script finished"
        });
      } else {
        this.setState({
          reading_idx: new_idx,
          reading_script: this.scripts[new_idx]
        });
      }
    }
    
    
    
  }

  render() {
    return (
      <div>
        <form>
  <label>
    Name:
    <input type="text" value={this.state.speaker} onChange={this.handleChangeSpeaker} />
  </label>
  
</form>
        <ReactMic
          record={this.state.record}
          className="sound-wave"
          onStop={this.onStop}
          onData={this.onData}
          strokeColor="#000000"
          backgroundColor="#FF4081" />
          <div>
          <div className="status">{this.state.reading_idx+'/'+this.scripts.length}</div>
        <button onClick={this.startRecording} type="button" style={this.state.record ?  { display: 'none' }: {} } >Start</button>
        <div className='reading'>{this.state.reading_script}</div>
        <button onClick={this.stopRecording} type="button" style={this.state.record ? {} : { display: 'none' }} >Save</button>
        <button onClick={this.stopRecordingNoSave} type="button" style={this.state.record ? {} : { display: 'none' }} >Retry</button>
        </div>
        
      </div>
    );
  }
}